trnila/stm32_rpi_examples/examples/touch/stm32/Src/freertos.c
/**
  ******************************************************************************
  * File Name          : freertos.c
  * Description        : Code for freertos applications
  ******************************************************************************
  * This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * Copyright (c) 2017 STMicroelectronics International N.V. 
  * All rights reserved.
  *
  * Redistribution and use in source and binary forms, with or without 
  * modification, are permitted, provided that the following conditions are met:
  *
  * 1. Redistribution of source code must retain the above copyright notice, 
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of STMicroelectronics nor the names of other 
  *    contributors to this software may be used to endorse or promote products 
  *    derived from this software without specific written permission.
  * 4. This software, including modifications and/or derivative works of this 
  *    software, must execute solely and exclusively on microcontroller or
  *    microprocessor devices manufactured by or for STMicroelectronics.
  * 5. Redistribution and use of this software other than as permitted under 
  *    this license is void and will automatically terminate your rights under 
  *    this license. 
  *
  * THIS SOFTWARE IS PROVIDED BY STMICROELECTRONICS AND CONTRIBUTORS "AS IS" 
  * AND ANY EXPRESS, IMPLIED OR STATUTORY WARRANTIES, INCLUDING, BUT NOT 
  * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A 
  * PARTICULAR PURPOSE AND NON-INFRINGEMENT OF THIRD PARTY INTELLECTUAL PROPERTY
  * RIGHTS ARE DISCLAIMED TO THE FULLEST EXTENT PERMITTED BY LAW. IN NO EVENT 
  * SHALL STMICROELECTRONICS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
  * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
  * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, 
  * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF 
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING 
  * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
  * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "FreeRTOS.h"
#include "task.h"
#include "cmsis_os.h"

/* USER CODE BEGIN Includes */     
#include "stm32f1xx.h"
#include "adc.h"
#include "usart.h"
#include <string.h>
/* USER CODE END Includes */

/* Variables -----------------------------------------------------------------*/
osThreadId defaultTaskHandle;
osThreadId touchHandle;

/* USER CODE BEGIN Variables */
int val;
#define size 50
int vals[size];

#define AXIS_Y 0
#define AXIS_X 1

int min[2];
int max[2];

int percent;
int current;

char data[50];

/* USER CODE END Variables */

/* Function prototypes -------------------------------------------------------*/
void StartDefaultTask(void const * argument);
void touchTask(void const * argument);

void MX_FREERTOS_Init(void); /* (MISRA C 2004 rule 8.1) */

/* USER CODE BEGIN FunctionPrototypes */
void pinMode(int pin, int mode) {
	GPIO_InitTypeDef GPIO_InitStruct;
	GPIO_InitStruct.Pin = pin;
	GPIO_InitStruct.Mode = mode;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
	HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
}

void digitalWrite(int pin, int state) {
	HAL_GPIO_WritePin(GPIOA, pin, state);
}

int adcRead() {
	if(HAL_ADC_Start(&hadc1) != HAL_OK) {
		for(;;);
	}
	if (HAL_ADC_PollForConversion(&hadc1, 1000000) == HAL_OK) {
		val = HAL_ADC_GetValue(&hadc1);
		HAL_ADC_Stop(&hadc1);
		return val;
	}
	return 42;
}

void measure(int axis) {
	for(int i = 0; i < size; i++) {
		vals[i] = adcRead();
	}
	for(int i = 0; i < size; i++) {
		for(int j = 0; j < size - 1; j++) {
			if(vals[j] > vals[j + 1]) {
				int tmp = vals[j];
				vals[j] = vals[j + 1];
				vals[j + 1] = tmp;
			}
		}
	}

	current = vals[size / 2];

	percent = (((float) current - min[axis]) / (max[axis] - min[axis]) * 100.0);
	if(percent < 0) {
		percent = 0;
	} else if(percent > 100) {
		percent = 100;
	}
}

/* USER CODE END FunctionPrototypes */

/* Hook prototypes */

/* Init FreeRTOS */

void MX_FREERTOS_Init(void) {
  /* USER CODE BEGIN Init */
       
  /* USER CODE END Init */

  /* USER CODE BEGIN RTOS_MUTEX */
  /* add mutexes, ... */
  /* USER CODE END RTOS_MUTEX */

  /* USER CODE BEGIN RTOS_SEMAPHORES */
  /* add semaphores, ... */
  /* USER CODE END RTOS_SEMAPHORES */

  /* USER CODE BEGIN RTOS_TIMERS */
  /* start timers, add new ones, ... */
  /* USER CODE END RTOS_TIMERS */

  /* Create the thread(s) */
  /* definition and creation of defaultTask */
  osThreadDef(defaultTask, StartDefaultTask, osPriorityNormal, 0, 128);
  defaultTaskHandle = osThreadCreate(osThread(defaultTask), NULL);

  /* definition and creation of touch */
  osThreadDef(touch, touchTask, osPriorityIdle, 0, 128);
  touchHandle = osThreadCreate(osThread(touch), NULL);

  /* USER CODE BEGIN RTOS_THREADS */
  /* add threads, ... */
  /* USER CODE END RTOS_THREADS */

  /* USER CODE BEGIN RTOS_QUEUES */
  /* add queues, ... */
  /* USER CODE END RTOS_QUEUES */
}

/* StartDefaultTask function */
void StartDefaultTask(void const * argument)
{

  /* USER CODE BEGIN StartDefaultTask */
  /* Infinite loop */
  for(;;)
  {
    osDelay(1000);
    HAL_GPIO_TogglePin(GPIOB, GPIO_PIN_1);
  }
  /* USER CODE END StartDefaultTask */
}

/* touchTask function */
void touchTask(void const * argument)
{
  /* USER CODE BEGIN touchTask */
#define YP GPIO_PIN_0
#define XM GPIO_PIN_1
#define YM GPIO_PIN_2
#define XP GPIO_PIN_3

	min[AXIS_Y] = 950;
	max[AXIS_Y] = 1770;

	min[AXIS_X] = 330;
	max[AXIS_X] = 1400;

	int X, Y;
	int PX, PY; // precent
	for(;;) {
		ADC_ChannelConfTypeDef sConfig;

		pinMode(YP, GPIO_MODE_ANALOG);
		pinMode(YM, GPIO_MODE_ANALOG);
		pinMode(XP, GPIO_MODE_OUTPUT_PP);
		pinMode(XM, GPIO_MODE_OUTPUT_PP);

		sConfig.Channel = ADC_CHANNEL_0;
		sConfig.Rank = 1;
		sConfig.SamplingTime = ADC_SAMPLETIME_1CYCLE_5;
		if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK)
		{
			_Error_Handler(__FILE__, __LINE__);
		}

		digitalWrite(XP, GPIO_PIN_SET);
		digitalWrite(XM, GPIO_PIN_RESET);

		osDelay(1);

		measure(AXIS_Y);
		Y = current;
		PY = percent;

		// ================== X AXIS ================


		/**Configure Regular Channel*/
		pinMode(XP, GPIO_MODE_ANALOG);
		pinMode(XM, GPIO_MODE_ANALOG);
		pinMode(YP, GPIO_MODE_OUTPUT_PP);
		pinMode(YM, GPIO_MODE_OUTPUT_PP);

		sConfig.Channel = ADC_CHANNEL_1;
		sConfig.Rank = 1;
		sConfig.SamplingTime = ADC_SAMPLETIME_1CYCLE_5;
		if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK)
		{
			_Error_Handler(__FILE__, __LINE__);
		}


		digitalWrite(YP, GPIO_PIN_SET);
		digitalWrite(YM, GPIO_PIN_RESET);

		osDelay(1);

		measure(AXIS_X);
		X = current;
		PX = percent;

		snprintf(data, sizeof(data), "X=%d Y=%d XP=%d XY=%d\r\n", X, Y, PX, PY);
		HAL_UART_Transmit(&huart1, data, strlen(data), HAL_MAX_DELAY);
	}
  /* USER CODE END touchTask */
}

/* USER CODE BEGIN Application */



     
/* USER CODE END Application */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
